app/views/groups/index.html.erb

SELECT "entities".* FROM "entities" INNER JOIN "group_entities" ON "entities"."id" = "group_entities"."entity_id" WHERE "group_entities"."group_id" = $1  [["group_id", 1]]
SELECT SUM("entities"."amount") FROM "entities" INNER JOIN "group_entities" ON "entities"."id" = "group_entities"."entity_id" WHERE "group_entities"."group_id" = $1  [["group_id", 1]]
---
</div>
<h3 class="second_item">$<%= format('%.2f', group.entities.sum(:amount)) %></h3>