app/controllers/entities_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    @group = Group.find(params[:group_id])

INSERT INTO "entities" ("name", "amount", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "McDonalds"], ["amount", 1], ["user_id", 1], ["created_at", "2023-07-03 15:44:33.324677"], ["updated_at", "2023-07-03 15:44:33.324677"]]
INSERT INTO "group_entities" ("group_id", "entity_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["group_id", 2], ["entity_id", 1], ["created_at", "2023-07-03 15:44:33.477755"], ["updated_at", "2023-07-03 15:44:33.477755"]]
---
  def create
    @entity = Entity.new(entity_params.merge(user: current_user))
    respond_to do |format|
      if @entity.save
        format.html { redirect_to group_entities_path, notice: "Entity was successfully created." }
        GroupEntity.create!(entity_id: @entity.id, group_id: params[:group_id])

SELECT "entities".* FROM "entities" WHERE "entities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_entity
    @entity = Entity.find(params[:id])