app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params.merge(user_id: current_user.id))

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("name", "icon", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"